import com.fasterxml.jackson.annotation.JsonProperty
import com.isyscore.kotlin.common.json.JSONArray
import com.isyscore.kotlin.common.json.JSONObject
import com.isyscore.kotlin.common.toJson
import com.isyscore.kotlin.common.toObj
import org.junit.Test

open class CSample(val name: String = "sample", val field1: String = "f1", val field2: String = "f2", val field3: String? = null)

class TestJson {

    @Test
    fun test() {
        val str = CSample().toJson()
        println(str)

        val json = """{"name":"sample2","field1":"f166","field2":"f266"}"""
        val o = json.toObj<CSample>()
        println(o)
    }

    @Test
    fun test1() {
        val json = """{"user_name":"hxj","user_age": 40}"""
        val u = json.toObj<SampleAssign>()
        println(u)
    }

    @Test
    fun test2() {
        val json = """[{"name":"aaaa", "age": 5},{"name":"bbbb", "age": 10}]"""
        val ja = JSONArray(json)
        val m: List<Map<String, Any?>> = ja.map { (it as JSONObject).toMap() }
        println(m)
    }

    @Test
    fun test3() {
        val json = """{'user_name':'hxj','age': 40}"""
        val u = json.toObj<SampleAssign>()
        println(u)
    }

    @Test
    fun test4() {
        println(SRTReq().toJson())
        "".lastIndex
    }
}


data class SampleAssign(
    var user_name: String = "",
    @JsonProperty("age")
    var user_age: Int = 0)

/*
{
    "filename": "1754362135845.mp4",
    "srtContext": "",
    "language": ""
}
 */

data class SRTReq(
    var filename: String = "1754362135845.mp4",
    var srtContext: String = SRT,
    var language: String = ""
)

val SRT =
"""1
00:00:00,000 --> 00:00:07,000
みきらない 冊しのペイヤジ

2
00:00:07,000 --> 00:00:14,000
飲まなくちゃ 光りになるよ

3
00:00:14,000 --> 00:00:21,000
悩み 詰まれたケールにそう

127
00:07:48,000 --> 00:07:50,000
この島に来て

128
00:07:50,000 --> 00:07:52,000
マグレだろうがない

129
00:07:52,000 --> 00:07:54,000
マグレだろうがない

130
00:07:54,000 --> 00:07:56,000
マグレだろうがない

131
00:07:56,000 --> 00:07:58,000
マグレだろうがない

132
00:07:58,000 --> 00:08:00,000
この島に来て

133
00:08:00,000 --> 00:08:02,000
マグレだろうがなんとか勝ち抜いて

134
00:08:02,000 --> 00:08:04,000
なのに

135
00:08:04,000 --> 00:08:07,000
ここまで来て夢を立たれちばうなんて

136
00:08:07,000 --> 00:08:10,000
俺はなんでこうバカなんだ

137
00:08:10,000 --> 00:08:12,000
しすが

138
00:08:12,000 --> 00:08:13,000
俺は

139
00:08:13,000 --> 00:08:15,000
俺は許してくる

140
00:08:19,000 --> 00:08:21,000
立ち上がれ上野地区

141
00:08:21,000 --> 00:08:22,000
ふっ

142
00:08:22,000 --> 00:08:23,000
増やしなみだなら

143
00:08:23,000 --> 00:08:24,000
デュールに負けた時に

144
00:08:24,000 --> 00:08:26,000
取っときなさい

145
00:08:26,000 --> 00:08:28,000
バカこれはなみだ

146
00:08:28,000 --> 00:08:32,000
ちょっともたまれしね

147
00:08:32,000 --> 00:08:33,000
ほら

148
00:08:33,000 --> 00:08:35,000
さっさと付きな

149
00:08:35,000 --> 00:08:37,000
ミッドもない

150
00:08:37,000 --> 00:08:40,000
この半個字に乗れた

151
00:08:40,000 --> 00:08:42,000
あんたの妹さんのことは

152
00:08:42,000 --> 00:08:44,000
あんずちゃんから聞いたわ

153
00:08:44,000 --> 00:08:46,000
上野地

154
00:08:46,000 --> 00:08:48,000
簡単に望みを捨てるなよ

155
00:08:48,000 --> 00:08:50,000
その妹さえの涙

156
00:08:50,000 --> 00:08:52,000
いや、鼻身だけ

157
00:08:52,000 --> 00:08:54,000
まあどっちでもいいな

158
00:08:55,000 --> 00:08:56,000
それに込めたねだよ

159
00:08:56,000 --> 00:08:58,000
鼻をといいわね

160
00:09:03,000 --> 00:09:04,000
これは

161
00:09:04,000 --> 00:09:05,000
まだ

162
00:09:05,000 --> 00:09:06,000
くちゃくまえ

163
00:09:06,000 --> 00:09:08,000
それがもう私には

164
00:09:08,000 --> 00:09:09,000
必要ないものよ

165
00:09:09,000 --> 00:09:10,000
まえ

166
00:09:10,000 --> 00:09:13,000
お前なんで俺なんかのために

167
00:09:13,000 --> 00:09:15,000
うそく伝っている日はないでしょ

168
00:09:15,000 --> 00:09:16,000
おは

169
00:09:16,000 --> 00:09:17,000
上野地

170
00:09:17,000 --> 00:09:18,000
ふっ

171
00:09:18,000 --> 00:09:19,000
なんだ

172
00:09:19,000 --> 00:09:20,000
はずのよ

173
00:09:21,000 --> 00:09:22,000
おは

174
00:09:24,000 --> 00:09:26,000
なんで

175
00:09:26,000 --> 00:09:28,000
中間だからに決まってるでしょ

176
00:09:28,000 --> 00:09:32,000
ちょうどいい

177
00:09:32,000 --> 00:09:34,000
うん

178
00:09:34,000 --> 00:09:36,000
うーん

179
00:09:36,000 --> 00:09:38,000
うーん

180
00:09:38,000 --> 00:09:40,000
うーん

181
00:09:40,000 --> 00:09:42,000
うーん

182
00:09:42,000 --> 00:09:45,000
しっかくを選択されに戻ってきやがったから

183
00:09:45,000 --> 00:09:47,000
3カットだ

184
00:09:47,000 --> 00:09:49,000
モンクはねぇな

185
00:09:50,000 --> 00:09:52,000
3カットだ

186
00:09:52,000 --> 00:09:54,000
モンクはねぇな

187
00:09:54,000 --> 00:09:56,000
うーん

188
00:09:56,000 --> 00:09:57,000
うーん

189
00:09:57,000 --> 00:09:58,000
うーん

190
00:09:58,000 --> 00:10:00,000
やつのカードは俺ぞ

191
00:10:00,000 --> 00:10:01,000
うん

192
00:10:01,000 --> 00:10:02,000
確かに

193
00:10:02,000 --> 00:10:04,000
ドーナメント出場を認める

194
00:10:04,000 --> 00:10:05,000
うーん

195
00:10:05,000 --> 00:10:06,000
きやきやか

196
00:10:06,000 --> 00:10:07,000
だがって

197
00:10:07,000 --> 00:10:08,000
さあキース

198
00:10:08,000 --> 00:10:10,000
さっさとデュールを始めようぜ

199
00:10:10,000 --> 00:10:11,000
きっ

200
00:10:11,000 --> 00:10:12,000
まい

201
00:10:12,000 --> 00:10:14,000
メンドだが相手してやるぜ

202
00:10:14,000 --> 00:10:17,000
どのみしてめを待ってるのは自動くだがな

203
00:10:17,000 --> 00:10:19,000
なら自動くでお前に勝つ

204
00:10:19,000 --> 00:10:21,000
このような気に

205
00:10:21,000 --> 00:10:23,000
これよりドーナメントに回転

206
00:10:23,000 --> 00:10:26,000
1カワードバーサス上の打ち勝てやの

207
00:10:26,000 --> 00:10:27,000
デュエルを始め

208
00:10:27,000 --> 00:10:28,000
いけ

209
00:10:28,000 --> 00:10:29,000
なのだ

210
00:10:29,000 --> 00:10:30,000
ダウンロード

211
00:10:30,000 --> 00:10:31,000
勝てよ

212
00:10:31,000 --> 00:10:33,000
上の打ち来た

213
00:10:33,000 --> 00:10:34,000
デュエル

214
00:10:34,000 --> 00:10:35,000
ダウンロード

215
00:10:35,000 --> 00:10:36,000
デュエル

216
00:10:48,000 --> 00:10:49,000
これより

512
00:21:36,000 --> 00:21:38,000
とりであげる

513
00:21:38,000 --> 00:21:40,000
楽しげな

514
00:21:40,000 --> 00:21:42,000
背中を

515
00:21:42,000 --> 00:21:46,000
伝えてあげる

516
00:21:46,000 --> 00:21:51,000
テクキのシャワー

517
00:21:51,000 --> 00:21:52,000
君は

518
00:21:52,000 --> 00:21:55,000
とりじゃないわ

519
00:21:55,000 --> 00:21:57,000
現状の

520
00:21:57,000 --> 00:21:59,000
おきなわに

521
00:21:59,000 --> 00:22:02,000
まのままで
"""